---------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 128, 128]           3,136
       BatchNorm2d-2         [-1, 64, 128, 128]             128
              ReLU-3         [-1, 64, 128, 128]               0
         MaxPool2d-4           [-1, 64, 64, 64]               0
            Conv2d-5           [-1, 64, 64, 64]          36,864
       BatchNorm2d-6           [-1, 64, 64, 64]             128
              ReLU-7           [-1, 64, 64, 64]               0
            Conv2d-8           [-1, 64, 64, 64]          36,864
       BatchNorm2d-9           [-1, 64, 64, 64]             128
             ReLU-10           [-1, 64, 64, 64]               0
       BasicBlock-11           [-1, 64, 64, 64]               0
           Conv2d-12           [-1, 64, 64, 64]          36,864
      BatchNorm2d-13           [-1, 64, 64, 64]             128
             ReLU-14           [-1, 64, 64, 64]               0
           Conv2d-15           [-1, 64, 64, 64]          36,864
      BatchNorm2d-16           [-1, 64, 64, 64]             128
             ReLU-17           [-1, 64, 64, 64]               0
       BasicBlock-18           [-1, 64, 64, 64]               0
           Conv2d-19          [-1, 128, 32, 32]          73,728
      BatchNorm2d-20          [-1, 128, 32, 32]             256
             ReLU-21          [-1, 128, 32, 32]               0
           Conv2d-22          [-1, 128, 32, 32]         147,456
      BatchNorm2d-23          [-1, 128, 32, 32]             256
           Conv2d-24          [-1, 128, 32, 32]           8,192
      BatchNorm2d-25          [-1, 128, 32, 32]             256
             ReLU-26          [-1, 128, 32, 32]               0
       BasicBlock-27          [-1, 128, 32, 32]               0
           Conv2d-28          [-1, 128, 32, 32]         147,456
      BatchNorm2d-29          [-1, 128, 32, 32]             256
             ReLU-30          [-1, 128, 32, 32]               0
           Conv2d-31          [-1, 128, 32, 32]         147,456
      BatchNorm2d-32          [-1, 128, 32, 32]             256
             ReLU-33          [-1, 128, 32, 32]               0
       BasicBlock-34          [-1, 128, 32, 32]               0
           Conv2d-35          [-1, 256, 16, 16]         294,912
      BatchNorm2d-36          [-1, 256, 16, 16]             512
             ReLU-37          [-1, 256, 16, 16]               0
           Conv2d-38          [-1, 256, 16, 16]         589,824
      BatchNorm2d-39          [-1, 256, 16, 16]             512
           Conv2d-40          [-1, 256, 16, 16]          32,768
      BatchNorm2d-41          [-1, 256, 16, 16]             512
             ReLU-42          [-1, 256, 16, 16]               0
       BasicBlock-43          [-1, 256, 16, 16]               0
           Conv2d-44          [-1, 256, 16, 16]         589,824
      BatchNorm2d-45          [-1, 256, 16, 16]             512
             ReLU-46          [-1, 256, 16, 16]               0
           Conv2d-47          [-1, 256, 16, 16]         589,824
      BatchNorm2d-48          [-1, 256, 16, 16]             512
             ReLU-49          [-1, 256, 16, 16]               0
       BasicBlock-50          [-1, 256, 16, 16]               0
           Conv2d-51            [-1, 512, 8, 8]       1,179,648
      BatchNorm2d-52            [-1, 512, 8, 8]           1,024
             ReLU-53            [-1, 512, 8, 8]               0
           Conv2d-54            [-1, 512, 8, 8]       2,359,296
      BatchNorm2d-55            [-1, 512, 8, 8]           1,024
           Conv2d-56            [-1, 512, 8, 8]         131,072
      BatchNorm2d-57            [-1, 512, 8, 8]           1,024
             ReLU-58            [-1, 512, 8, 8]               0
       BasicBlock-59            [-1, 512, 8, 8]               0
           Conv2d-60            [-1, 512, 8, 8]       2,359,296
      BatchNorm2d-61            [-1, 512, 8, 8]           1,024
             ReLU-62            [-1, 512, 8, 8]               0
           Conv2d-63            [-1, 512, 8, 8]       2,359,296
      BatchNorm2d-64            [-1, 512, 8, 8]           1,024
             ReLU-65            [-1, 512, 8, 8]               0
       BasicBlock-66            [-1, 512, 8, 8]               0
    ResNetEncoder-67  [[-1, 1, 256, 256], [-1, 64, 128, 128], [-1, 64, 64, 64], [-1, 128, 32, 32], [-1, 256, 16, 16], [-1, 512, 8, 8]]               0
         Identity-68            [-1, 512, 8, 8]               0
         Identity-69          [-1, 768, 16, 16]               0
        Attention-70          [-1, 768, 16, 16]               0
           Conv2d-71          [-1, 256, 16, 16]       1,769,472
      BatchNorm2d-72          [-1, 256, 16, 16]             512
             ReLU-73          [-1, 256, 16, 16]               0
           Conv2d-74          [-1, 256, 16, 16]         589,824
      BatchNorm2d-75          [-1, 256, 16, 16]             512
             ReLU-76          [-1, 256, 16, 16]               0
         Identity-77          [-1, 256, 16, 16]               0
        Attention-78          [-1, 256, 16, 16]               0
     DecoderBlock-79          [-1, 256, 16, 16]               0
         Identity-80          [-1, 384, 32, 32]               0
        Attention-81          [-1, 384, 32, 32]               0
           Conv2d-82          [-1, 128, 32, 32]         442,368
      BatchNorm2d-83          [-1, 128, 32, 32]             256
             ReLU-84          [-1, 128, 32, 32]               0
           Conv2d-85          [-1, 128, 32, 32]         147,456
      BatchNorm2d-86          [-1, 128, 32, 32]             256
             ReLU-87          [-1, 128, 32, 32]               0
         Identity-88          [-1, 128, 32, 32]               0
        Attention-89          [-1, 128, 32, 32]               0
     DecoderBlock-90          [-1, 128, 32, 32]               0
         Identity-91          [-1, 192, 64, 64]               0
        Attention-92          [-1, 192, 64, 64]               0
           Conv2d-93           [-1, 64, 64, 64]         110,592
      BatchNorm2d-94           [-1, 64, 64, 64]             128
             ReLU-95           [-1, 64, 64, 64]               0
           Conv2d-96           [-1, 64, 64, 64]          36,864
      BatchNorm2d-97           [-1, 64, 64, 64]             128
             ReLU-98           [-1, 64, 64, 64]               0
         Identity-99           [-1, 64, 64, 64]               0
       Attention-100           [-1, 64, 64, 64]               0
    DecoderBlock-101           [-1, 64, 64, 64]               0
        Identity-102        [-1, 128, 128, 128]               0
       Attention-103        [-1, 128, 128, 128]               0
          Conv2d-104         [-1, 32, 128, 128]          36,864
     BatchNorm2d-105         [-1, 32, 128, 128]              64
            ReLU-106         [-1, 32, 128, 128]               0
          Conv2d-107         [-1, 32, 128, 128]           9,216
     BatchNorm2d-108         [-1, 32, 128, 128]              64
            ReLU-109         [-1, 32, 128, 128]               0
        Identity-110         [-1, 32, 128, 128]               0
       Attention-111         [-1, 32, 128, 128]               0
    DecoderBlock-112         [-1, 32, 128, 128]               0
          Conv2d-113         [-1, 16, 256, 256]           4,608
     BatchNorm2d-114         [-1, 16, 256, 256]              32
            ReLU-115         [-1, 16, 256, 256]               0
          Conv2d-116         [-1, 16, 256, 256]           2,304
     BatchNorm2d-117         [-1, 16, 256, 256]              32
            ReLU-118         [-1, 16, 256, 256]               0
        Identity-119         [-1, 16, 256, 256]               0
       Attention-120         [-1, 16, 256, 256]               0
    DecoderBlock-121         [-1, 16, 256, 256]               0
     UnetDecoder-122         [-1, 16, 256, 256]               0
          Conv2d-123          [-1, 1, 256, 256]             145
        Identity-124          [-1, 1, 256, 256]               0
         Sigmoid-125          [-1, 1, 256, 256]               0
      Activation-126          [-1, 1, 256, 256]               0
================================================================
Total params: 14,321,937
Trainable params: 14,321,937
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.25
Forward/backward pass size (MB): 284.75
Params size (MB): 54.63
Estimated Total Size (MB): 339.63
----------------------------------------------------------------